DataProcessors/ЖурналЗанятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>ЖурналЗанятия</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ОценкиСтудентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ОценкиСтудентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отметка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отметки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Степень</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПромежуточнаяАттестация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПромежуточнаяАттестация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Дисциплина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Дисциплины</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗанятия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контингент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АктуальностьКонтингента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>АктуальностьКонтингента</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Специальность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специальности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДвижениеКонтингента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДвижениеКонтингента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контингент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РасписаниеНаДату.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>РасписаниеНаДату</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЖурналСоздан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖурналЗаполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаЖурнал</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПроведениеЗанятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗанятиеПоРП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДомашнееЗадание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Литература</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОрганизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормаОрганизацииОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПромежуточнаяАттестация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПромежуточнаяАттестация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дисциплина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Дисциплины</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Занятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкаУрока</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кадры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗанятия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Семестр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кабинет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кабинеты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЖурналЗанятия/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ГруппаПриИзменении(Элемент)
	ДинамическийСписокЖурнал.Параметры.УстановитьЗначениеПараметра("Группа", Группа);
	ЗаполнитьЖурнал();
КонецПроцедуры

&НаКлиенте
Процедура ДисциплинаПриИзменении(Элемент)
	ДинамическийСписокЖурнал.Параметры.УстановитьЗначениеПараметра("Дисциплина", Дисциплина);
	ЗаполнитьЖурнал();
КонецПроцедуры

Процедура ЗаполнитьЖурнал()
	РеквизитыТаблицы = ПолучитьРеквизиты("ЖурналУспеваемости");
	Если Не РеквизитыТаблицы = 0 Тогда
		УдаляемыеРеквизиты = Новый Массив;
		Для Каждого Реквизит Из РеквизитыТаблицы Цикл
			УдаляемыеРеквизиты.Добавить("ЖурналУспеваемости." + Реквизит.Имя);
			Элементы.Удалить(Элементы[Реквизит.Имя]);
		КонецЦикла;
		ИзменитьРеквизиты(, УдаляемыеРеквизиты);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Группа) И ЗначениеЗаполнено(Дисциплина) Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	АктуальностьКонтингентаСрезПоследних.Группа КАК Группа,
		|	ОценкиСтудентов.Дисциплина КАК Дисциплина,
		|	ОценкиСтудентов.ДатаЗанятия КАК ДатаЗанятия,
		|	ОценкиСтудентов.Обучающийся КАК Обучающийся,
		|	ОценкиСтудентов.Отметка КАК Отметка
		|ИЗ
		|	РегистрСведений.ОценкиСтудентов КАК ОценкиСтудентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальностьКонтингента.СрезПоследних КАК АктуальностьКонтингентаСрезПоследних
		|		ПО ОценкиСтудентов.Обучающийся = АктуальностьКонтингентаСрезПоследних.Обучающийся
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасписаниеНаДату КАК РасписаниеНаДату
		|		ПО ОценкиСтудентов.ДатаЗанятия = РасписаниеНаДату.ДатаЗанятия
		|ГДЕ
		|	АктуальностьКонтингентаСрезПоследних.Группа = &Группа
		|	И ОценкиСтудентов.Дисциплина = &Дисциплина");
			
		Запрос.УстановитьПараметр("Группа", Группа);
		Запрос.УстановитьПараметр("Дисциплина", Дисциплина);

		ОценкиСтудентов = Запрос.Выполнить().Выгрузить();
		
		ТаблицаСоответствий = РаботаДокументов.ПолучитьИдентификаторыДанных(
						ОценкиСтудентов,
						"ДатаЗанятия");
						
		ОценкиСтудентов_Служебная.Загрузить(ТаблицаСоответствий);
		Для Каждого Строка Из ОценкиСтудентов_Служебная Цикл
			Строка.Заголовок = Строка.ДатаЗанятия;
			Строка.Тип = Новый ОписаниеТипов("СправочникСсылка.Отметки");
		КонецЦикла;

		КроссТаблица = РаботаДокументов.ТрансформироватьДанныеВКроссТаблицу(
						ОценкиСтудентов.Выгрузить(),
						ОценкиСтудентов_Служебная,
						"Обучающийся",
						"Отметка");
		
		//
		МассивРеквизитов = Новый Массив;
		Для Каждого Колонка Из КроссТаблица.Колонки Цикл
			МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя,
						Колонка.ТипЗначения, "ЖурналУспеваемости",
						Колонка.Заголовок,
						Истина));
		КонецЦикла;
		ИзменитьРеквизиты(МассивРеквизитов);
		
		Для Каждого Колонка Из КроссТаблица.Колонки Цикл
			НовыйЭлемент = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), Элементы.ЖурналУспеваемости);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "ЖурналУспеваемости." + Колонка.Имя;
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(КроссТаблица, "ЖурналУспеваемости");
		
	КонецЕсли;
КонецПроцедуры
